In [3]:
import pandas as pd
import numpy as np

In [4]:
#第一个参数是存放在DataFrame里的数据
#第二个参数index就是之前说的行名（或者应该叫索引？）
#第三个参数columns是之前说的列名。
df1 = pd.DataFrame(np.random.randn(4,4),index = list('ABCD') , columns = list('ABCD'))
df1

          A         B         C         D
A  0.829203 -1.121911  0.227292  1.183743
B -1.892372  1.546858 -0.858880 -0.073357
C  1.113449 -1.763456  0.787751 -1.867122
D  1.910582  2.643881  0.966260  0.739575

In [5]:
# 数据量小的话可以自己输入
df2 = pd.DataFrame([[1,2,3,4],[2,3,4,5],[3,4,5,6],[4,5,6,7]],index = list('ABCD'),columns = list('1234'))
df2

   1  2  3  4
A  1  2  3  4
B  2  3  4  5
C  3  4  5  6
D  4  5  6  7

In [6]:
# 使用字典创建
# 仍然是使用DataFrame这个函数，但是字典的每个key的value代表一列，而key是这一列的列名
dic1 = {'name':['a','b','c','d'],'age':[17,20,5,40],'gender':['男','女','女','男']}
df3 = pd.DataFrame(dic1)
df3

  name  age gender
0    a   17      男
1    b   20      女
2    c    5      女
3    d   40      男

In [7]:
#查看列的数据类型
df3.dtypes

name      object
age        int64
gender    object
dtype: object

In [11]:
#查看DataFrame的头尾

#使用head可以查看前几行的数据，默认的是前5行，不过也可以自己设置。

#使用tail可以查看后几行的数据，默认也是5行，参数可以自己设置。

#比如随意设置一个6*6的数据，只看前5行。

df4 = pd.DataFrame(np.random.randn(6,6))
df4.head()

          0         1         2         3         4         5
0 -1.494325  0.291202 -0.028499  2.179065 -0.907518 -0.144613
1 -0.534699 -0.345128  0.409797 -0.860319  1.005159  0.425003
2  0.833353  0.379571 -0.151389  2.223263  0.659228  1.463767
3  0.284752 -2.100989 -0.340597 -0.624575 -0.211795  0.858339
4 -0.892972 -0.409016 -0.610432 -0.570636 -1.148817 -0.030562

In [12]:
#只看前三行
df4.head(3)

          0         1         2         3         4         5
0 -1.494325  0.291202 -0.028499  2.179065 -0.907518 -0.144613
1 -0.534699 -0.345128  0.409797 -0.860319  1.005159  0.425003
2  0.833353  0.379571 -0.151389  2.223263  0.659228  1.463767

In [13]:
# 后5行
df4.tail()

          0         1         2         3         4         5
1 -0.534699 -0.345128  0.409797 -0.860319  1.005159  0.425003
2  0.833353  0.379571 -0.151389  2.223263  0.659228  1.463767
3  0.284752 -2.100989 -0.340597 -0.624575 -0.211795  0.858339
4 -0.892972 -0.409016 -0.610432 -0.570636 -1.148817 -0.030562
5 -0.107268  0.704263  0.519617 -0.016040 -0.023247  0.143214

In [15]:
#使用index查看行名，columns查看列名
df1.index

Index(['A', 'B', 'C', 'D'], dtype='object')

In [16]:
df3.columns

Index(['name', 'age', 'gender'], dtype='object')

In [17]:
# 查看数据值
df3.values

array([['a', 17, '男'],
       ['b', 20, '女'],
       ['c', 5, '女'],
       ['d', 40, '男']], dtype=object)

In [18]:
# 查看某一列所有的数据值
df3['name'].values

array(['a', 'b', 'c', 'd'], dtype=object)

In [19]:
#还有另一种操作，使用loc或者iloc查看数据值（但是好像只能根据行来查看？）。
#区别是loc是根据行名，iloc是根据数字索引（也就是行号）。
df1.loc['A']# 返回的是df1中A这一行的数据

A    0.829203
B   -1.121911
C    0.227292
D    1.183743
Name: A, dtype: float64

In [20]:
df1.iloc[0]

A    0.829203
B   -1.121911
C    0.227292
D    1.183743
Name: A, dtype: float64

In [21]:
#按列进行索引查看数据还能直接使用列名，但这种方法对行索引不适用。
df3['name'] # name这一列的数据

0    a
1    b
2    c
3    d
Name: name, dtype: object

In [22]:
# 使用shape查看行列数，参数为0表示查看行数，参数为1表示查看列数。
df3.shape[0]

4

In [23]:
df3.shape[1]

3

In [24]:
# 转置
df3.T

         0   1  2   3
name     a   b  c   d
age     17  20  5  40
gender   男   女  女   男

In [25]:
#使用describe可以对数据根据列进行描述性统计。
df1.describe()
#如果有的列是非数值型的，那么就不会进行统计。

#如果想对行进行描述性统计，请参看4.1（转置后进行describe呀！）

              A         B         C         D
count  4.000000  4.000000  4.000000  4.000000
mean   0.490216  0.326343  0.280606 -0.004290
std    1.653027  2.107553  0.822311  1.346560
min   -1.892372 -1.763456 -0.858880 -1.867122
25%    0.148810 -1.282297 -0.044251 -0.521798
50%    0.971326  0.212473  0.507521  0.333109
75%    1.312732  1.821114  0.832378  0.850617
max    1.910582  2.643881  0.966260  1.183743

In [26]:
#使用sum默认对每列求和，sum(1)为对每行求和
df3.sum()

name      abcd
age         82
gender    男女女男
dtype: object

In [28]:
df3.sum(1)#对每行求和

0    17
1    20
2     5
3    40
dtype: int64

In [29]:
df2

   1  2  3  4
A  1  2  3  4
B  2  3  4  5
C  3  4  5  6
D  4  5  6  7

In [31]:
#数乘运算使用apply
df2.apply(lambda x:x*2)
#如果元素是字符串，则会把字符串再重复一遍。

   1   2   3   4
A  2   4   6   8
B  4   6   8  10
C  6   8  10  12
D  8  10  12  14

In [32]:
#乘方运算
df2**2

    1   2   3   4
A   1   4   9  16
B   4   9  16  25
C   9  16  25  36
D  16  25  36  49

In [33]:
#扩充列可以直接像字典一样，列名对应一个list，
#但是注意list的长度要跟index的长度一致。
df2['E']=['999','999','999','999']
df2

   1  2  3  4    E
A  1  2  3  4  999
B  2  3  4  5  999
C  3  4  5  6  999
D  4  5  6  7  999

In [36]:
#还可以使用insert，使用这个方法可以指定把列插入到第几列，其他的列顺延。
df2.insert(0,'g',[888,888,888,888])
df2

     g    F  1  2  3  4    E
A  888  888  1  2  3  4  999
B  888  888  2  3  4  5  999
C  888  888  3  4  5  6  999
D  888  888  4  5  6  7  999

In [37]:
#使用join可以将两个DataFrame合并，但只根据行列名合并，
#并且以作用的那个DataFrame的为基准。如下所示，新的df7是以df2的行号index为基准的。
df6 = pd.DataFrame(['my','name','is','a'],index = list('ACDH'),columns = list('G'))
df6

      G
A    my
C  name
D    is
H     a

In [38]:
df7 = df2.join(df6)

In [39]:
df7

     g    F  1  2  3  4    E     G
A  888  888  1  2  3  4  999    my
B  888  888  2  3  4  5  999   NaN
C  888  888  3  4  5  6  999  name
D  888  888  4  5  6  7  999    is

In [41]:
#但是，join这个方法还有how这个参数可以设置，
#合并两个DataFrame的交集或并集。参数为'inner'表示交集，'outer'表示并集。
df8 = df2.join(df6,how='inner')
df8

     g    F  1  2  3  4    E     G
A  888  888  1  2  3  4  999    my
C  888  888  3  4  5  6  999  name
D  888  888  4  5  6  7  999    is

In [42]:
df9=df2.join(df6,how='outer')
df9

       g      F    1    2    3    4    E     G
A  888.0  888.0  1.0  2.0  3.0  4.0  999    my
B  888.0  888.0  2.0  3.0  4.0  5.0  999   NaN
C  888.0  888.0  3.0  4.0  5.0  6.0  999  name
D  888.0  888.0  4.0  5.0  6.0  7.0  999    is
H    NaN    NaN  NaN  NaN  NaN  NaN  NaN     a